


概念不清 

感受你的愚蠢吧  

知道自己在哪 要去哪 是多么好的一件事 

我今年27 没有成年  

ES6
underscore 这是什么 

ajax   


浏览器
dom bom






只是其中的一种组合而已






只有点-线



大
是通用  是范围

看书

源码 

js封装  
jq封装

类




css 树
http://javascript.ruanyifeng.com/dom/css.html



 

小  是点

jQuery 的无 new 调用
双循环







阶段一

内容：
	html
		理解创建网页的基本语法规范  常用的标签与属性 网页间的链接与跳转 标签节点 层级节点
	css 
		行内样式  内部样式 外部样式 盒模型 常用布局
	js 
		基础语法和变量 数据类型转换 条件判断  循环语句 函数 数组 
	简单页面
		css抽象与复用 float margin padding border 定位 居中

目标：
	熟悉媒体查询和响应式设计 
	熟悉基础css格式和css盒模型
	理解链接跳转 _blank 多列布局 
	理解如何创建一个简单页面


阶段二 
内容：
	js基础
		js语言的基本构成 变量 数据类型 表达式  流程控制 顺序 判断  循环 短路 函数
	dom+bom
		dom基本操作 节点对象操作 事件操作 常见的bom功能
	网页特效
		在特效中常用的编程接口  动画 事件对象 冒泡 轮播图 导航栏  正则 
	jquery 
		选择器 动画 事件 插件机制  原理分析  写一个简单的作品
	
目标：
	能够基于jquery实现酷炫的效果 和复杂的功能模块
	能创建或添加自定义效果到页面上
	能熟练添加标准的动画效果到页面上
	熟练操作dom模型



阶段三
内容：
	html5+css3
		语义化结构 多媒体 本地存储  css3选择器 css3边框 背景 阴影 过渡 动画 伸缩盒 
	服务端
		理解服务器搭建 xml json 
	ajax 
		基本的编程接口 数据获取  发送  跨域  
	移动web开发
		响应式 bootstrap zepto  预编译css

目标
	能够基于jquery/zepto进行移动端js开发
	基于原生或框架进行响应式效果开发 
	基于jquery bootstrap实现酷炫效果 和 功能模块
	能独立制作电商网站 以及常见js 动态效果



阶段四
	面向对象在js中的体现与实践
		对象的基本概念 面向对象理论  
	开发过程中常用的模式与思想
		开放封闭原则 mvc思想 高内聚低耦合 设计模式 
	js高级特性
		构造函数 原型 原型链 继承 作用域链 闭包  沙箱 
	封装一个自己的框架 
		选择器框架 属性操作封装  dom操作封装  事件框架封装












异步轮询

路由

封装  

js属性类型 

类 

ajax  

CommonJS
requirejs
Promise
Underscore
lodash.js  是一个一致性、模块化、高性能的 JavaScript 实用工具库。


WebGL, Web Workers, Service Workers


展示页面
http://www.cnblogs.com/lijiayi/p/githubpages.html



git  

node

hexo    


页面



















++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

 css--    js--  jquery--  ajax--     git--
-------------------------------------------------------------------------------------------------------------------------------------




-------------------------------------------------------------------------------------------------------------------------------------







css--

--------------------------------------------------------------------------------------------------------------------------------

  
 jquery-- 


 深拷贝  



     
是否使用jq封装过组件
事件委托



















-------------------------------------------------------------------------------------------------------------------------------------

 


















js--








js是解释型语言  不需要编译 


new和Object.create的区别

滚动效果的实现，用原生js实现，

怎么判断一个对象为空对象呢


cookie与session的区别
没答全

cookie存放在客户端，session存放在服务端
cookie不安全，session存放在服务器，较安全
session过多，影响服务器性能
单个cookie保存的数据不能超过4K

数组去重

let const 和 var的区别
es6中，箭头函数的this指向    与this的区别

css加载与js加载有什么不同
 
	css是并行加载，js是串行加载

按需加载、动态异步加载






解释下MVC中的三个字母的含义
 
从输入一个url到页面完成渲染，经历了哪些过程
 




es6中，新增了哪些数组方法

	from、of、find、findIndex、fill、entries 、keys 、values、includes

js中，哪些数组方法是改变自身，哪些是得到一个新数组
	没答全

	改变自身：push、pop、shift、unshift、fill、reverse、sort、splice、copyWithin
	返回新数组：from、map、concat、filter



Js事件委托
	
Js中_proto_，说一下原型链



如何使用谷歌浏览器调试被压缩过后的代码
 


主要是讲promise，async/await的具体使用，与区别

 
 


单例模式，观察者模式


MVC的基础是观察者模式，这是实现model和view同步的关键





-------------------------------------------------------------------------------------------------------------------------------------










































ajax--


1234

请求过程

ajax是同步还是异步，怎么实现同步


promise版本的ajax


Ajax 解决浏览器缓存问题
	在ajax发送请求前加上 anyAjaxObj.setRequestHeader("If-Modified-Since","0")。
	
	在ajax发送请求前加上 anyAjaxObj.setRequestHeader("Cache-Control","no-cache")。
	
	在URL后面加上一个随机数： "fresh=" + Math.random()。
	
	在URL后面加上时间搓："nowtime=" + new Date().getTime()。
	
	如果是使用jQuery，直接这样就可以了 $.ajaxSetup({cache:false})。这样页面的所有ajax都会执行这条语句就是不需要保存缓存记录。



ajax 留言板



git--




单页面富应用 spa

mvc 设计模式  高性能 蝴蝶书







js设计模式与开发实战 曾探

	1.面向对象 原型模式和基于原型继承的javascript对象系统
	2.call apply 
	3.闭包 高阶函数
	
	设计模式
		单例模式
		代理模式
		订阅发布
	
	设计原则 
		单一职责原则
		最少知识原则
		开放封闭原则
		接口和面向接口编程
		代码重构
	


javascript设计模式  作者:ross
	接口
	封装
	继承 

	单体模式
	方法的链式调用
	工厂模式
	桥接模式
	组合模式
	代理模式
	观察者模式




mvc    显示 调度 数据

    mvc和类
    	创建类 给类添加属性 和方法  添加私有函数
    
    事件和监听
    
    	监听事件  取消事件 事件对象   委托事件  自定义事件
    
    模型和数据
    	mvc和命名空间
    	构建对象的关系映射 orm
    	原型继承
    	
    	添加ORM 属性
    	持久化记录
    	增加id支持
    	寻址引用
    	装载数据 
    	直接嵌套数据
    	通过ajax载入数据
    	jsonp
    	跨域请求的安全性
    
    
    	向ORM中 添加记录
    	本地存储 localStorage  sessionStorage
    
    	给ORM添加本地存储
    	将新纪录提交给服务器
    
    控制器和状态
    
    	模块模式
    	全局导入 导出
    	添加少量上下文
    	
    	抽象出 库
    	
    	文档加载完成后载入控制器
    	访问视图
    	委托事件
    	状态机
    	路由选择
    	使用URL中的哈希
    	检测哈希变化
    	抓取ajax
    	使用HTML5 history
    
    视图和模板
    	动态渲染视图
    	模板
    	模板 help()
    	模板存储
    	模型中的事件绑定
    
    
  




生命周期
数据绑定
计算属性 watch
指令
组件
继承
双向绑定
渲染

路由 




 
黄轶 vue音乐
 
 4-1 页面简介+轮播图数据分析
 4-2 jsonp原理介绍+Promise封装
 4-3 jsonp的应用+轮播图数据抓取
 4-4 轮播图组件实现（上)
 4-5 轮播图组件实现（中)
 4-6 轮播图组件实现（下）
 4-7 歌单数据接口分析
 4-8 axios 介绍和后端接口代理
 4-9 歌单列表组件开发和数据的应用
 4-10 scroll 组件的抽象和应用（上）
 4-11 scroll 组件的抽象和应用（下）
 4-12 vue-lazyload 懒加载插件介绍和应用
 4-13 loading 基础组件的开发和应用
第5章 歌手页面开发
包括歌手数据的抓取和处理、Singer 类的封装、类通讯录组件 listview开发和应用。

 5-1 歌手页面布局和设计讲解
 5-2 歌手数据接口抓取
 5-3 歌手数据处理和 Singer 类的封装
 5-4 listview 基础组件的开发和应用-滚动列表实现
 5-5 listview 基础组件的开发和应用-右侧快速入口实现（1）
 5-6 listview 基础组件的开发和应用-右侧快速入口实现（2）
 5-7 listview 基础组件的开发和应用-右侧快速入口实现（3）
 5-8 listview 基础组件的开发和应用-右侧快速入口实现（4）
 5-9 listview 基础组件的开发和应用-滚动固定标题实现（上）
 5-10 listview 基础组件的开发和应用-滚动固定标题实现（下）
第6章 歌手详情页开发
包括子路由的配置及转场动画实现、Vuex 的介绍、Vuex 初始化歌手数据的配置、歌手详情页数据抓取和处理、Song 类的封装、music-list 组件开发。

 6-1 歌手详情页布局和设计详解
 6-2 子路由配置以及转场动画实现
 6-3 初识 Vuex
 6-4 Vuex 初始化及歌手数据的配置
 6-5 歌手详情数据抓取
 6-6 歌手详情数据处理和Song类的封装（上）
 6-7 歌手详情数据处理和Song类的封装（下）
 6-8 music-list 组件开发（1）
 6-9 music-list 组件开发（2）
 6-10 music-list 组件开发（3）
 6-11 music-list 组件开发（4）
 6-12 music-list 组件开发（5）
 6-13 music-list 组件开发（6）
 6-14 music-list 组件开发（7）
第7章 播放器内置组件开发

 7-1 播放器页面设计详解
 7-2 播放器Vuex数据设计
 7-3 播放器Vuex的相关应用
 7-4 播放器基础样式及歌曲数据的应用
 7-5 播放器展开收起动画（上）
 7-6 播放器展开收起动画（中）
 7-7 播放器展开收起动画（下）
 7-8 播放器歌曲播放功能实现
 7-9 播放器歌曲前进后退功能实现（上）
 7-10 播放器歌曲前进后退功能实现（下）
 7-11 播放器播放时间获取和更新
 7-12 播放器progress-bar进度条组件实现（上）
 7-13 播放器progress-bar进度条组件实现（中）
 7-14 播放器progress-bar进度条组件实现（下）
 7-15 播放器progress-circle 圆形进度条组件实现
 7-16 播放器模式切换功能实现（上）
 7-17 播放器模式切换功能实现（中）
 7-18 播放器模式切换功能实现（下）
 7-19 播放器歌词数据抓取
 7-20 播放器歌词数据解析
 7-21 播放器歌词滚动列表实现
 7-22 播放器歌词左右滑动实现（上）
 7-23 播放器歌词左右滑动实现（下）
 7-24 播放器歌词剩余功能实现
 7-25 播放器底部播放器适配+mixin的应用
第8章 歌单页面开发
包括歌单页面的布局介绍、Vuex 实现路由数据通讯、歌单详情页数据抓取和处理。

 8-1 歌单详情页布局介绍及Vuex实现路由数据通讯
 8-2 歌单详情页数据抓取
 8-3 歌单详情页数据的处理和应用
第9章 排行榜及详情页开发
包括排行榜布局介绍、排行榜数据抓取和应用、榜单详情页布局介绍、Vuex 实现路由数据通讯、榜单详情页数据抓取和应用。

 9-1 排行页面布局介绍及排行榜数据抓取
 9-2 排行页排行榜数据应用
 9-3 榜单详情页布局介绍及Vuex实现路由数据通讯
 9-4 榜单详情页数据抓取和应用
 9-5 带排行的song-list组件扩展和应用
第10章 搜索页面开发
包括search-box 组件开发、热门搜索数据抓取和应用、suggest 组件开发、搜索结果保存功能实现、search-list 组件开发、confirm 组件开发。

 10-1 搜索页面页面布局和功能介绍
 10-2 搜索页面search-box组件开发
 10-3 搜索页面热门搜索数据抓取和应用
 10-4 搜索页面suggest组件开发（1）
 10-5 搜索页面suggest组件开发（2）
 10-6 搜索页面suggest组件开发（3）
 10-7 搜索页面suggest组件开发（4）
 10-8 搜索页面suggest组件开发（5）
 10-9 搜索页面suggest组件开发（6）
 10-10 搜索页面suggest组件开发（7）
 10-11 搜索页面搜索结果保存功能实现（1）
 10-12 搜索页面搜索结果保存功能实现（2）
 10-13 搜索页面搜索结果保存功能实现（3）
 10-14 搜索页面search-list 组件功能实现（上）
 10-15 搜索页面search-list 组件功能实现（下）
 10-16 搜索页面confirm 组件功能实现
 10-17 搜索页面剩余功能实现（上）
 10-18 搜索页面剩余功能实现（下）
第11章 歌曲列表组件
包括歌曲列表组件的显示和隐藏控制、播放列表的实现、player mixin 的抽象、 add-song 组件开发、top-list 组件开发、scroll 组件能力的扩展

 11-1 歌曲列表组件布局和功能介绍
 11-2 歌曲列表组件显示和隐藏的控制
 11-3 歌曲列表组件播放列表的实现（1）
 11-4 歌曲列表组件播放列表的实现（2）
 11-5 歌曲列表组件播放列表的实现（3）
 11-6 歌曲列表组件播放列表的实现（4）
 11-7 歌曲列表组件播放列表的实现（5）
 11-8 歌曲列表组件 playerMixin的抽象（上）
 11-9 歌曲列表组件 playerMixin的抽象（下）
 11-10 歌曲列表组件add-song组件实现（1）
 11-11 歌曲列表组件add-song组件实现（2）
 11-12 歌曲列表组件add-song组件实现（3）
 11-13 歌曲列表组件add-song组件实现（4）
 11-14 歌曲列表组件add-song组件实现（5）
 11-15 歌曲列表组件add-song组件实现（6）
 11-16 歌曲列表组件top-list组件实现
 11-17 歌曲列表组件scroll组件能力的扩展
第12章 用户中心页面
包括收藏列表的 Vuex 数据设计与实现、收藏歌曲功能实现、页面功能开发。

 12-1 用户中心页面布局和功能介绍
 12-2 用户中心页面收藏列表的Vuex数据设计和实现
 12-3 用户中心页面收藏歌曲功能实现（上）
 12-4 用户中心页面收藏歌曲功能实现（下）
 12-5 用户中心页面剩余功能实现（上）
 12-6 用户中心页面剩余功能实现（下）
第13章 编译打包
包括播放内核小 bug 修复、项目编译打包及 node 服务调试、路由组件实现懒加载、Vue.js 升级到最新版。

 13-1 编译打包-播放内核小bug修复
 13-2 编译打包-项目编译打包及node服务测试
 13-3 编译打包-路由组件实现懒加载
 13-4 编译打包-Vue.js升级到最新版
第14章 课程总结
包括移动端常用工具 charles 和 vconsole 的介绍、课程回顾。

 14-1 移动端调试工具和抓包工具介绍（上）
 14-2 移动端调试工具和抓包工具介绍（下）
 14-3 课程总结
第15章 课程有关资料汇总
课程有关资料汇总

 15-1 课程资料汇总





黄轶 vue 源码

第2章 数据驱动
详细讲解了模板数据到 DOM 渲染的过程，
从 new Vue 开始，分析了 mount、render、update、patch 等流程。

 2-1 数据驱动
 2-2 new Vue 发生了什么 试看
 2-3 Vue 实例挂载的实现
 2-4 render
 2-5 Virtual DOM
 2-6 createElement
 2-7 update

 第3章 组件化
分析了组件化的实现原理，并且分析了组件周边的原理实现，包括合并配置、生命周期、组件注册、异步组件。

 3-1 组件化
 3-2 createComponent
 3-3 patch（上）
 3-4 patch（下）
 3-5 合并配置（上）
 3-6 合并配置（下）
 3-7 生命周期
 3-8 组件注册（上）
 3-9 组件注册（下）
 3-10 异步组件（工厂函数）
 3-11 异步组件（Promise）
 3-12 异步组件（高级）


 讲解了数据的变化如何驱动视图的变化，分析了响应式对象的创建，依赖收集、派发更新的实现过程
 从编译的入口函数开始，分析了编译的三个核心流程的实现：parse -> optimize -> codegen。
 详细讲解了 event、v-model、slot、keep-alive、transition、transition-group 等常用功能的原理实现