
设计模式  就是给一些好的设计取个名字

创建型 
	单例 
	工厂

行为型 
	观察者


继承关系 用 是 来表示
	自行车是车 猫是动物


泛化关系
	A继承自B
	A --> B


实现关系
	继承抽象类
	车”为一个抽象概念，在现实中并无法直接用来定义对象；只有指明具体的子类(汽车还是自行车)，才 可以用来定义对象

聚合关系
	整体由部分构成的语义
	非强依赖   部门撤销了，人员不会消失，他们依然存在；

组合关系
	整体由部分构成的语义
	强依赖     公司不存在了，部门也将不存在了；



大部分设计模式，是让你在在面向对象的基础上尽量消除继承的手段  如果你用了一些设计模式，减少了继承 那就是用对了  but 继承自纯虚类不应该视为继承 纯虚类等于接口



设计模式是为了封装变化，
	让各个模块可以独立变化。精准地使用设计模式的前提是你能够精准的预测需求变更的走向。
	All problems in computer science can be solved by another level of indirection   - David Wheeler 


源码
	K:\JavaScript设计模式与开发实践-源代码



